books/books-by-author.org
#+title: Books by Author
#+options: num:nil ^:nil creator:nil author:nil timestamp:nil

* uk
#+BEGIN_EXAMPLE
  |    | Author                 | Title                                    |
  |----+------------------------+------------------------------------------|
  |  1 | Anthony Burgess        | A Clockwork Orange                       |
  |  2 | Arthur Conan Doyle     | The Hound of the Baskervilles            |
  |  3 | Charles Dickens        | The Old Curiosity Shop                   |
  |  4 | Charles Dickens        | Great Expectations                       |
  |  5 | Charles Dickens        | A Tale of Two Cities                     |
  |  6 | Daphne du Maurier      | Hungry Hill                              |
  |  7 | Emily Brontë           | Wuthering Heights                        |
  |  8 | Frederick Forsyth      | The Day of the Jackal                    |
  |  9 | Frederick Forsyth      | The Odessa File                          |
  | 10 | Frederick Forsyth      | The Dogs of War                          |
  | 11 | George Eliot           | Silas Marner                             |
  | 12 | George Orwell          | Keep the Aspidistra Flying               |
  | 13 | George Orwell          | Coming Up for Air                        |
  | 14 | George Orwell          | Animal Farm                              |
  | 15 | George Orwell          | Nineteen Eighty-Four                     |
  | 16 | George Orwell          | Down and Out in Paris and London         |
  | 17 | George Orwell          | The Road to Wigan Pier                   |
  | 18 | George Orwell          | Homage to Catalonia                      |
  | 19 | Graham Greene          | Brighton Rock                            |
  | 20 | Graham Greene          | The End of the Affair                    |
  | 21 | Ian McEwan             | On Chesil Beach                          |
  | 22 | Irvine Welsh           | Trainspotting                            |
  | 23 | Irvine Welsh           | Marabou Stork Nightmares                 |
  | 24 | Irvine Welsh           | Filth                                    |
  | 25 | Irvine Welsh           | Glue                                     |
  | 26 | Irvine Welsh           | Porno                                    |
  | 27 | Irvine Welsh           | The Bedroom Secrets of the Master Chefs  |
  | 28 | Irvine Welsh           | Skagboys                                 |
  | 29 | Irvine Welsh           | The Acid House                           |
  | 30 | Irvine Welsh           | Ecstasy: Three Tales of Chemical Romance |
  | 31 | Irvine Welsh           | If You Liked School You'll Love Work     |
  | 32 | John Healy             | The Grass Arena                          |
  | 33 | Joseph Conrad          | Heart of Darkness                        |
  | 34 | Nick Hornby            | High Fidelity                            |
  | 35 | Nick Hornby            | About a Boy                              |
  | 36 | Robert Harris          | Fatherland                               |
  | 37 | Robert Harris          | Enigma                                   |
  | 38 | Robert Harris          | Archangel                                |
  | 39 | Robert Harris          | Pompeii                                  |
  | 40 | Robert Harris          | Imperium                                 |
  | 41 | Robert Harris          | The Ghost                                |
  | 42 | Robert Louis Stevenson | Treasure Island                          |
  | 43 | Robert Louis Stevenson | The Black Arrow                          |
  | 44 | Rudyard Kipling        | Kim                                      |
  | 45 | Thomas Hardy           | Far from the Madding Crowd               |
  | 46 | William Golding        | Lord of the Flies                        |
#+END_EXAMPLE  

Roald Dahl
jane austen
john le carre
douglas adams
jk rowling
tolkien

* irish
#+BEGIN_EXAMPLE
  |    | Author           | Title                                        |
  |----+------------------+----------------------------------------------|
  |  1 | Erskine Childers | Riddle of the Sands                          |
  |  2 | Flann O'Brien    | At Swim-Two-Birds                            |
  |  3 | Frank McCourt    | Angela's Ashes                               |
  |  4 | James Joyce      | Dubliners                                    |
  |  5 | James Joyce      | A Portrait of the Artist as a Young Man      |
  |  6 | James Joyce      | Ulysses                                      |
  |  7 | James Plunkett   | Strumpet City                                |
  |  8 | John Banville    | The Book of Evidence                         |
  |  9 | John Banville    | The Untouchable                              |
  | 10 | Joseph O'Connor  | Star of the Sea                              |
  | 11 | Joseph O'Connor  | Cowboys and Indians                          |
  | 12 | Joseph O'Connor  | Desperadoes                                  |
  | 13 | Oscar Wilde      | De Profundis                                 |
  | 14 | Oscar Wilde      | The Happy Prince and Other Stories           |
  | 15 | Oscar Wilde      | Lord Arthur Savile's Crime and Other Stories |
  | 16 | Oscar Wilde      | The Picture of Dorian Gray                   |
  | 17 | Oscar Wilde      | The Ballad of Reading Gaol                   |
  | 18 | Roddy Doyle      | The Commitments                              |
  | 19 | Roddy Doyle      | The Snapper                                  |
  | 20 | Roddy Doyle      | The Van                                      |
  | 21 | Roddy Doyle      | Paddy Clarke Ha Ha Ha                        |
  | 22 | Samuel Beckett   | Molloy*                                      |
#+END_EXAMPLE
  
john mcgahern?

* us
#+BEGIN_EXAMPLE
  |    | Author              | Title                                     |               |
  |----+---------------------+-------------------------------------------+---------------|
  |  1 | Bret Easton Ellis   | American Psycho                           |               |
  |  2 | Don DeLillo         | White Noise                               |               |
  |  3 | Ernest Hemingway    | A Farewell to Arms                        |               |
  |  4 | Ernest Hemingway    | For Whom the Bell Tolls                   |               |
  |  5 | Ernest Hemingway    | The Old Man and the Sea                   |               |
  |  6 | F. Scott Fitzgerald | The Great Gatsby                          |               |
  |  7 | Harper Lee          | To Kill a Mockingbird                     |               |
  |  8 | Hunter S. Thompson  | Fear and Loathing in Las Vegas            |               |
  |  9 | J. D. Salinger      | The Catcher in the Rye                    |               |
  | 10 | Jack Kerouac        | On The Road*                              |               |
  | 11 | John Kennedy Toole  | A Confederacy of Dunces                   |               |
  | 12 | John Steinbeck      | The Grapes of Wrath                       |               |
  | 13 | John Steinbeck      | The Pearl                                 |               |
  | 14 | John Steinbeck      | Of Mice and Men                           |               |
  | 15 | John Updike         | Rabbit, Run*                              |               |
  | 16 | Ken Kesey           | One Flew Over the Cuckoo's Nest           |               |
  | 17 | Mario Puzo          | The Godfather                             |               |
  | 18 | Mario Puzo          | Omertà                                    |               |
  | 19 | Philip Roth         | American Pastoral                         |               |
  | 20 | Robert M. Pirsig    | Zen and the Art of Motorcycle Maintenance |               |
  | 21 | Sinclair Lewis      | Babbitt                                   | 9780099264712 |
  | 22 | Sinclair Lewis      | It Can't Happen Here                      |               |
  | 23 | Stephen Crane       | The Red Badge of Courage*                 |               |
  | 24 | Stephen King        | It                                        |               |
  | 25 | Tom Wolfe           | The Bonfire of the Vanities               |               |
  | 26 | Truman Capote       | In Cold Blood                             |               |
  | 27 | Vladimir Nabokov    | Lolita                                    |               |
#+END_EXAMPLE

- Mark Twain
- Herman Melville
- Edgar Allan Poe
- William Faulkner
- Henry James?

* french
- Alexandre Dumas
  - count of monte cristo
  - musketeers?
- Albert Camus
  - The Plague
- Victor Hugo?
- Guy de Maupassant
  - Boule de Suif
- Jules Verne

* russian
- Leo Tolstoy
  - War and Peace
  - Anna Karenina
  - The Death of Ivan Ilyich
- Aleksandr Solzhenitsyn
  - The First Circle
  - The Gulag Archipelago
- Fyodor Dostoyevsky
  - Crime and Punishment
- Anton Chekhov

* german
- Hermann Hesse steppenwolf
- kafka trial
- Erich Maria Remarque / All Quiet on the Western Front

* spanish
- Miguel de Cervantes
  - Don Quixote
* others

#+BEGIN_EXAMPLE
  | Gregory David Roberts | Shantaram                             |
  | Stieg Larsson         | The Girl with the Dragon Tattoo       |
  | Stieg Larsson         | The Girl Who Played with Fire         |
  | Stieg Larsson         | The Girl Who Kicked the Hornets' Nest |
  | Khaled Hosseini       | The Kite Runner                       |
#+END_EXAMPLE

[[file:books.html][back]]
