books/books-by-author.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Books by Author</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Books by Author</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">uk</a></li>
<li><a href="#sec-2">irish</a></li>
<li><a href="#sec-3">us</a></li>
<li><a href="#sec-4">french</a></li>
<li><a href="#sec-5">russian</a></li>
<li><a href="#sec-6">german</a></li>
<li><a href="#sec-7">spanish</a></li>
<li><a href="#sec-8">others</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">uk</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
|    | Author                 | Title                                    |
|----+------------------------+------------------------------------------|
|  1 | Anthony Burgess        | A Clockwork Orange                       |
|  2 | Arthur Conan Doyle     | The Hound of the Baskervilles            |
|  3 | Charles Dickens        | The Old Curiosity Shop                   |
|  4 | Charles Dickens        | Great Expectations                       |
|  5 | Charles Dickens        | A Tale of Two Cities                     |
|  6 | Daphne du Maurier      | Hungry Hill                              |
|  7 | Emily Brontë           | Wuthering Heights                        |
|  8 | Frederick Forsyth      | The Day of the Jackal                    |
|  9 | Frederick Forsyth      | The Odessa File                          |
| 10 | Frederick Forsyth      | The Dogs of War                          |
| 11 | George Eliot           | Silas Marner                             |
| 12 | George Orwell          | Keep the Aspidistra Flying               |
| 13 | George Orwell          | Coming Up for Air                        |
| 14 | George Orwell          | Animal Farm                              |
| 15 | George Orwell          | Nineteen Eighty-Four                     |
| 16 | George Orwell          | Down and Out in Paris and London         |
| 17 | George Orwell          | The Road to Wigan Pier                   |
| 18 | George Orwell          | Homage to Catalonia                      |
| 19 | Graham Greene          | Brighton Rock                            |
| 20 | Graham Greene          | The End of the Affair                    |
| 21 | Ian McEwan             | On Chesil Beach                          |
| 22 | Irvine Welsh           | Trainspotting                            |
| 23 | Irvine Welsh           | Marabou Stork Nightmares                 |
| 24 | Irvine Welsh           | Filth                                    |
| 25 | Irvine Welsh           | Glue                                     |
| 26 | Irvine Welsh           | Porno                                    |
| 27 | Irvine Welsh           | The Bedroom Secrets of the Master Chefs  |
| 28 | Irvine Welsh           | Skagboys                                 |
| 29 | Irvine Welsh           | The Acid House                           |
| 30 | Irvine Welsh           | Ecstasy: Three Tales of Chemical Romance |
| 31 | Irvine Welsh           | If You Liked School You'll Love Work     |
| 32 | John Healy             | The Grass Arena                          |
| 33 | Joseph Conrad          | Heart of Darkness                        |
| 34 | Nick Hornby            | High Fidelity                            |
| 35 | Nick Hornby            | About a Boy                              |
| 36 | Robert Harris          | Fatherland                               |
| 37 | Robert Harris          | Enigma                                   |
| 38 | Robert Harris          | Archangel                                |
| 39 | Robert Harris          | Pompeii                                  |
| 40 | Robert Harris          | Imperium                                 |
| 41 | Robert Harris          | The Ghost                                |
| 42 | Robert Louis Stevenson | Treasure Island                          |
| 43 | Robert Louis Stevenson | The Black Arrow                          |
| 44 | Rudyard Kipling        | Kim                                      |
| 45 | Thomas Hardy           | Far from the Madding Crowd               |
| 46 | William Golding        | Lord of the Flies                        |
</pre>

<p>
Roald Dahl
jane austen
john le carre
douglas adams
jk rowling
tolkien
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">irish</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
|    | Author           | Title                                        |
|----+------------------+----------------------------------------------|
|  1 | Erskine Childers | Riddle of the Sands                          |
|  2 | Flann O'Brien    | At Swim-Two-Birds                            |
|  3 | Frank McCourt    | Angela's Ashes                               |
|  4 | James Joyce      | Dubliners                                    |
|  5 | James Joyce      | A Portrait of the Artist as a Young Man      |
|  6 | James Joyce      | Ulysses                                      |
|  7 | James Plunkett   | Strumpet City                                |
|  8 | John Banville    | The Book of Evidence                         |
|  9 | John Banville    | The Untouchable                              |
| 10 | Joseph O'Connor  | Star of the Sea                              |
| 11 | Joseph O'Connor  | Cowboys and Indians                          |
| 12 | Joseph O'Connor  | Desperadoes                                  |
| 13 | Oscar Wilde      | De Profundis                                 |
| 14 | Oscar Wilde      | The Happy Prince and Other Stories           |
| 15 | Oscar Wilde      | Lord Arthur Savile's Crime and Other Stories |
| 16 | Oscar Wilde      | The Picture of Dorian Gray                   |
| 17 | Oscar Wilde      | The Ballad of Reading Gaol                   |
| 18 | Roddy Doyle      | The Commitments                              |
| 19 | Roddy Doyle      | The Snapper                                  |
| 20 | Roddy Doyle      | The Van                                      |
| 21 | Roddy Doyle      | Paddy Clarke Ha Ha Ha                        |
| 22 | Samuel Beckett   | Molloy*                                      |
</pre>

<p>
john mcgahern?
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">us</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
|    | Author              | Title                                     |               |
|----+---------------------+-------------------------------------------+---------------|
|  1 | Bret Easton Ellis   | American Psycho                           |               |
|  2 | Don DeLillo         | White Noise                               |               |
|  3 | Ernest Hemingway    | A Farewell to Arms                        |               |
|  4 | Ernest Hemingway    | For Whom the Bell Tolls                   |               |
|  5 | Ernest Hemingway    | The Old Man and the Sea                   |               |
|  6 | F. Scott Fitzgerald | The Great Gatsby                          |               |
|  7 | Harper Lee          | To Kill a Mockingbird                     |               |
|  8 | Hunter S. Thompson  | Fear and Loathing in Las Vegas            |               |
|  9 | J. D. Salinger      | The Catcher in the Rye                    |               |
| 10 | Jack Kerouac        | On The Road*                              |               |
| 11 | John Kennedy Toole  | A Confederacy of Dunces                   |               |
| 12 | John Steinbeck      | The Grapes of Wrath                       |               |
| 13 | John Steinbeck      | The Pearl                                 |               |
| 14 | John Steinbeck      | Of Mice and Men                           |               |
| 15 | John Updike         | Rabbit, Run*                              |               |
| 16 | Ken Kesey           | One Flew Over the Cuckoo's Nest           |               |
| 17 | Mario Puzo          | The Godfather                             |               |
| 18 | Mario Puzo          | Omertà                                    |               |
| 19 | Philip Roth         | American Pastoral                         |               |
| 20 | Robert M. Pirsig    | Zen and the Art of Motorcycle Maintenance |               |
| 21 | Sinclair Lewis      | Babbitt                                   | 9780099264712 |
| 22 | Sinclair Lewis      | It Can't Happen Here                      |               |
| 23 | Stephen Crane       | The Red Badge of Courage*                 |               |
| 24 | Stephen King        | It                                        |               |
| 25 | Tom Wolfe           | The Bonfire of the Vanities               |               |
| 26 | Truman Capote       | In Cold Blood                             |               |
| 27 | Vladimir Nabokov    | Lolita                                    |               |
</pre>

<ul class="org-ul">
<li>Mark Twain
</li>
<li>Herman Melville
</li>
<li>Edgar Allan Poe
</li>
<li>William Faulkner
</li>
<li>Henry James?
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">french</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Alexandre Dumas
<ul class="org-ul">
<li>count of monte cristo
</li>
<li>musketeers?
</li>
</ul>
</li>
<li>Albert Camus
<ul class="org-ul">
<li>The Plague
</li>
</ul>
</li>
<li>Victor Hugo?
</li>
<li>Guy de Maupassant
<ul class="org-ul">
<li>Boule de Suif
</li>
</ul>
</li>
<li>Jules Verne
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">russian</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Leo Tolstoy
<ul class="org-ul">
<li>War and Peace
</li>
<li>Anna Karenina
</li>
<li>The Death of Ivan Ilyich
</li>
</ul>
</li>
<li>Aleksandr Solzhenitsyn
<ul class="org-ul">
<li>The First Circle
</li>
<li>The Gulag Archipelago
</li>
</ul>
</li>
<li>Fyodor Dostoyevsky
<ul class="org-ul">
<li>Crime and Punishment
</li>
</ul>
</li>
<li>Anton Chekhov
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">german</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Hermann Hesse steppenwolf
</li>
<li>kafka trial
</li>
<li>Erich Maria Remarque / All Quiet on the Western Front
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">spanish</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>Miguel de Cervantes
<ul class="org-ul">
<li>Don Quixote
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">others</h2>
<div class="outline-text-2" id="text-8">
<pre class="example">
| Gregory David Roberts | Shantaram                             |
| Stieg Larsson         | The Girl with the Dragon Tattoo       |
| Stieg Larsson         | The Girl Who Played with Fire         |
| Stieg Larsson         | The Girl Who Kicked the Hornets' Nest |
| Khaled Hosseini       | The Kite Runner                       |
</pre>

<p>
<a href="books.html">back</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
